recreational_areas_backend/app/controllers/recreational_areas_controller.rb

SELECT "recreational_areas".* FROM "recreational_areas" WHERE "recreational_areas"."user_id" = ?  [["user_id", 1]]
SELECT 1 AS one FROM "recreational_areas" WHERE "recreational_areas"."facility_name" = ? AND "recreational_areas"."user_id" = ? LIMIT ?  [["facility_name", "BOLDING MILL"], ["user_id", 1], ["LIMIT", 1]]
INSERT INTO "recreational_areas" ("facility_name", "facility_description", "facility_id", "facility_directions", "facility_email", "facility_phone", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        rec_area = @user.recreational_areas.new(rec_area_params)

        if (RecreationalArea.where(facility_name: rec_area.facility_name, user_id: @user).exists?)
            render json:
            {
                status: 400,
                message: "Unable to save to favorites."
            }
        else
            rec_area.save

SELECT "recreational_areas".* FROM "recreational_areas" WHERE "recreational_areas"."user_id" = ? AND "recreational_areas"."id" = ? LIMIT ?  [["user_id", 1], ["id", 6], ["LIMIT", 1]]
DELETE FROM "recreational_areas" WHERE "recreational_areas"."id" = ?  [["id", 6]]
---
    def destroy
        rec_area = @user.recreational_areas.find_by_id(params[:id])

        rec_area.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_user
        @user = User.find_by_id(params[:user_id])