recreational_areas_backend/app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "test@test.com"], ["LIMIT", 1]]
---
    def create
        user = User.find_by(email: params[:user][:email])