recreational_areas_backend/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
    def create
        user = User.new(user_params)

        if user.valid? && params[:user][:password] == params[:user][:password_confirmation]
            user.save